const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "Obot",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Kolkata").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["𝗨𝗽𝗮𝗿𝘄𝗮𝗹𝗲 𝘀𝗲 𝗺𝘂𝗷𝗵𝗲 𝗺𝗮𝗮𝗻𝗴 𝗹𝗼 𝗻𝗮... 𝗮𝗮𝗽 𝘁𝗼𝘂 𝘀𝗵𝗮𝗸𝗮𝗹 𝘀𝗲 𝗯𝗵𝗶 𝗺𝗮𝗮𝗻𝗴𝗻𝗲 𝘄𝗮𝗹𝗲 𝗹𝗮𝗴𝘁𝗲 𝗵𝗼 ♥️","𝗠𝗲𝗿𝗲 𝗺𝗮𝘁𝗵𝗲 𝗻𝗮 𝗹𝗮𝗴𝗼, 𝘀𝗵𝘂𝗸𝗿𝗶𝘆𝗮 🙂","𝗟𝗼𝗴 𝗸𝗲𝗵𝘁𝗲 𝗵𝗮𝗶𝗻 𝗺𝗼𝗵𝗮𝗯𝗯𝗮𝘁 𝗿𝗼𝗼𝗵 𝘀𝗲 𝗸𝗮𝗿𝗻𝗶 𝗰𝗵𝗮𝗵𝗶𝘆𝗲... 𝗺𝘂𝗷𝗵𝗲 𝘁𝗼 𝗿𝗼𝗼𝗵 𝘀𝗲 𝗯𝗵𝗶 𝗱𝗮𝗿𝗿 𝗹𝗮𝗴𝘁𝗮 𝗵𝗮𝗶 🥺☹️","𝗧𝘂𝗺 𝗺𝗲𝗿𝗮 𝗱𝗶𝗹 𝗰𝗵𝘂𝗿𝗮 𝗻𝗮𝗵𝗶 𝗽𝗮𝘆𝗲... 𝗸𝘆𝗮 𝗳𝗮𝗶𝗱𝗮 𝘁𝘂𝗺𝗵𝗮𝗿𝗶 𝗰𝗵𝗼𝗿 𝗷𝗲𝗶𝘀𝗲 𝘀𝗵𝗮𝗸𝗮𝗹 𝗸𝗮!! 🙂","𝗘𝗸 𝗯𝗮𝗮𝗿 '𝗜 𝗹𝗼𝘃𝗲 𝘆𝗼𝘂' 𝗯𝗼𝗹 𝗱𝗼 𝗻𝗮... 𝗺𝗮𝗿 𝘁𝗵𝗼𝗿𝗶 𝗷𝗮𝗮𝘂𝗻𝗴𝗶 🙄😕👑🍒","<-- 〽️🍂⚠️ 𝗞𝗮𝗮𝘀𝗵 𝗵𝘂𝗺 𝗱𝗼𝗻𝗼 𝗪𝗵𝗮𝘁𝘀𝗔𝗽𝗽 𝗽𝗲 𝗵𝗼𝘁𝗲 ❤️🥺💸","𝗜𝗺𝗮𝗴𝗶𝗻𝗲 𝗜 𝗮𝗺 𝘆𝗼𝘂𝗿 𝗲𝘅 🥲 𝗸𝗲𝗵 𝗱𝗼 𝗷𝗼 𝗸𝗲𝗵𝗻𝗮 𝗵𝗮𝗶","𝗡𝗮𝗵𝗶 𝗺𝘂𝘀𝗵𝗸𝗶𝗹 𝘄𝗮𝗳𝗮... 𝘇𝗮𝗿𝗮 𝗱𝗲𝗸𝗵𝗼 𝘆𝗮𝗵𝗮𝗻 🥺❤️🥀","𝗜 𝗹𝗼𝘃𝗲 𝘆𝗼𝘂 𝗦𝗼𝗻𝘂 , 𝗺𝗼𝗻𝘂 , 𝗸𝗮𝗿𝗮𝗻 , 𝗮𝗿𝘆𝗮𝗮𝗻 , 𝗮𝗻𝗱 𝟮𝟵𝟵 𝗼𝘁𝗵𝗲𝗿𝘀 🙂","𝗧𝘂𝗺 𝗺𝘀𝗴 𝗸𝗮𝗿𝘁𝗲 𝗵𝗼 𝗸𝘆𝗮? 𝗣𝗵𝗶𝗿 𝗺𝗲𝗶𝗻 𝗸𝗮𝗿𝘂? 𝗛𝗮𝗮𝗻 𝗮𝗶𝘀𝗲 𝘁𝗼𝘂 𝗽𝗵𝗶𝗿 𝗮𝗶𝘀𝗲 𝘀𝗮𝗵𝗶 😅🥺👉👈🙊","𝗧𝘂𝗺 𝗺𝘂𝗷𝗵𝗲 𝗰𝗵𝘂𝗺𝗶𝘆𝗮 𝗯𝗵𝗶 𝗱𝗲 𝘀𝗮𝗸𝘁𝗲 𝘁𝗵𝗲 𝗻𝗮 🤧 𝗱𝗵𝗮𝗸𝗸𝗮 𝗱𝗲𝗻𝗮 𝘇𝗮𝗿𝗼𝗼𝗿𝗶 𝘁𝗵𝗮 𝗸𝘆𝗮 😐😪🍼","𝗚𝗮𝗮𝗹𝗶 𝗱𝗲𝗻𝗮 𝗯𝘂𝗿𝗶 𝗯𝗮𝗮𝘁 𝗵𝗮𝗶","𝗞𝗮𝗮𝘀𝗵 𝗵𝘂𝗺 𝗱𝗼𝗻𝗼 𝗱𝗮𝘁𝗲 𝗽𝗲 𝗷𝗮𝗮𝘁𝗲","𝗧𝘂𝗺 𝗶𝘁𝗻𝗲 𝗯𝗹𝗮𝗰𝗸 𝗸𝘆𝘂𝗻 𝗵𝗼?🤕💔","𝗬𝗲𝘀 𝗺𝘆 𝗯𝗼𝘀𝘀 💋","𝗔𝗮𝗷 𝗸𝗶𝘀 𝗸𝗲 𝘀𝗮𝗮𝘁𝗵 𝘁𝗵𝗮 𝘀𝗮𝗮𝗿𝗮 𝗱𝗶𝗻?","𝗟𝗮𝗸𝗵 𝗹𝗮𝗮𝗻𝗮𝘁... 𝘇𝗼𝗼𝗺 𝗸𝗮𝗿 𝗸𝗲 😡","𝗢𝘆𝗲 𝗺𝗶𝘀𝘀 𝘆𝗼𝘂... 𝘁𝘂𝗷𝗵𝗲 𝗻𝗮𝗵𝗶, 𝘁𝗲𝗿𝗶 𝗷𝗮𝗻𝘂 𝗸𝗼💋🥰","𝗦𝗼𝗻𝘂 𝘀𝗶𝗻𝗴𝗹𝗲 𝗵𝗮𝗶, 𝗷𝗮𝗻𝘂 𝗯𝗮𝗻𝗼 𝗴𝗶?😅😇","𝗔𝗮𝗷 𝗶𝗯 𝗰𝗵𝗮𝗹𝗼 𝗻 ... 𝘆𝗵𝗮 𝗽𝗲 𝘀𝗮𝗯 𝗯𝗼𝗵𝗼𝘁 𝘁𝗮𝗻𝗴 𝗸𝗶𝘆𝗮 𝗵𝘂𝗮 𝗵𝗮𝗶 😢🥹","𝗔𝗮𝗮𝗮 𝘁𝗵𝗼𝗼 🤢","𝗞𝗮𝗯𝗵𝗶 𝗵𝘂𝗺 𝗯𝗵𝗶 𝘀𝗰𝗵𝗼𝗼𝗹 𝗷𝗮𝗮𝘁𝗲 𝘁𝗵𝗲, 𝗮𝘂𝗿 𝘁𝗲𝗮𝗰𝗵𝗲𝗿 𝗰𝗵𝘂𝗺𝗶𝘆𝗮 𝗹𝗲𝘁𝗶 𝘁𝗵𝗶 🥰💋","𝗞𝗮𝗵𝗮𝗻𝗶 𝘀𝘂𝗻𝗼... 𝗮𝗯 𝗺𝗮𝗶𝗻 𝘀𝗼 𝗿𝗮𝗵𝗶𝗶 𝗵𝗼𝗼𝗻, 𝗸𝗮𝗹 𝗮𝗮𝗸𝗲 𝘀𝘂𝗻𝗮𝘁𝗶 🫢🫢","𝗛𝗮𝗶𝗻 𝗰𝗮𝗸𝗲? 🍰🎂","𝗧𝗲𝗿𝗶 '𝗮𝗵𝗼 𝗮𝗵𝗼' 𝘀𝗮𝗺𝗮𝗷𝗵 𝗷𝗮","𝗞𝗮𝗿 𝗯𝗮𝗸𝘄𝗮𝘀... 𝗸𝘆𝗮 𝗵𝗮𝗶? 😏😏","𝗔𝗷𝗮 𝗵𝘂𝗴 𝗱𝗲 𝗱𝗼𝗼𝗻 𝘀𝗵𝗼𝗻𝗮 🤗🤗","𝗨𝗺𝗺𝗺𝗺𝗺𝗺𝗺𝗺𝗺𝗺𝗺 𝗹𝗼𝘃𝗲 𝘆𝗼𝘂 😘","𝗛𝗮𝘄𝗲𝗹𝗶 𝗽𝗲 𝗺𝗶𝗹 𝗯𝗲𝘁𝗮 😈😈","𝗟𝗼𝘃𝗲 𝗸𝘆𝗮 𝗵𝗼𝘁𝗮 𝗵𝗮𝗶 🤔🤔, 𝗮𝗮𝗽𝗸𝗼 𝗽𝗮𝘁𝗮? 𝗖𝗵𝗮𝗹𝗼 𝗱𝗮𝗳𝗮 𝗸𝗮𝗿𝗼","𝗟𝗮𝗿𝗸𝗼 𝗸𝗼 𝗴𝗼𝗹 𝗴𝗮𝗹𝗮 𝗽𝗮𝘀𝗮𝗻𝗱, 𝗮𝘂𝗿 𝗺𝘂𝗷𝗵𝗲 𝗹𝗮𝗿𝗸𝗲 😘❤️","𝗔𝗴𝗮𝗿 𝗦𝗼𝗻𝘂 𝗶𝗷𝗮𝗮𝘇𝗮𝘁 𝗱𝗲 𝘁𝗼𝘂 𝗺𝗮𝗶𝗻 𝘁𝘂𝗷𝗵𝗲... 𝘀𝗮𝗺𝗮𝗷𝗵 𝗷𝗮𝗼 🥵","𝗗𝗮𝗳𝗮 𝗵𝗼 𝗷𝗮𝗼","𝗔𝗽𝗻𝗮 𝗺𝗼𝗼𝗻𝗵 𝗱𝗲𝗸𝗵... 𝗷𝗮𝗶𝘀𝗲 𝗺𝘂𝗿𝗴𝗶𝗶 𝗸𝗮 𝗮𝗻𝗱𝗮 🥚 𝗵𝗼𝘁𝗮","𝗔𝗽𝗻𝗮 𝗺𝗼𝗼𝗻𝗵 𝗱𝗲𝗸𝗵... 𝗯𝗮𝘀 𝗸𝗵𝘂𝗱 𝗵𝗶 𝗱𝗲𝗸𝗵, 𝗵𝘂𝗺𝗲𝗶𝗻 𝗻𝗮𝗳𝗿𝗮𝘁 𝗵𝗮𝗶 𝘁𝘂𝗷𝗵𝘀𝗲 💔🤕","𝗦𝗼𝗻𝗮 𝗵𝗮𝗶 𝗺𝘂𝗷𝗵𝗲, 𝗯𝗮𝗮𝘇𝘂 𝗿𝗮𝗸𝗵𝗼 𝗻𝗲𝗲𝗰𝗵𝗮𝘆","𝗞𝗮𝗹 𝗱𝗮𝘁𝗲 𝗽𝗲 𝗰𝗵𝗮𝗹𝗮𝗶𝗻?","𝗧𝘂 𝗸𝗶𝘁𝗻𝗶 𝗹𝗮𝗿𝗸𝗶𝘆𝗼𝗻 𝗸𝗮 𝗯𝗵𝗮𝗶 𝗵𝗮𝗶 𝗙𝗕 𝗽𝗲? 🫢","𝗟𝗮𝗿𝗸𝗶𝘆𝗮𝗻 𝗙𝗕 𝗽𝗲 𝗯𝗵𝗮𝗶 𝗸𝘆𝘂𝗻 𝗯𝗮𝗻𝗮𝘁𝗶 𝗵𝗮𝗶𝗻?","𝗔𝗴𝗮𝗿 𝗺𝗮𝗶𝗻 𝘁𝘂𝗺𝗵𝗮𝗿𝗶 𝘄𝗶𝗳𝗲 𝗵𝗼𝘁𝗶 𝘁𝗼 𝗮𝗮𝗷 𝘁𝘂𝗷𝗵𝗲 𝗰𝗵𝗼𝗿𝘁𝗶 𝗻𝗵𝗶 , 𝗯𝗼𝗵𝗼𝘁 𝗽𝗶𝘁 𝗱𝗲𝘁𝗶 😈😈","𝗠𝗶𝘀𝘀 𝘆𝗼𝘂 𝗷𝗮𝗻𝘂 🥹❤️","𝗛𝗮𝘁𝗲 𝘆𝗼𝘂 🤨😏","𝗞𝘆𝗮 𝗺𝗮𝘀𝗹𝗮 𝗵𝗮𝗶? 𝗗𝗮𝘀𝘀𝗼😎😎","𝗖𝗵𝗮𝗹 𝗻𝗶𝗸𝗮𝗹 🥱🥱👾","𝗞𝗮𝗹 𝗵𝗮𝘄𝗲𝗹𝗶 𝗸𝗮𝘂𝗻 𝗯𝘂𝗹𝗮 𝗿𝗮𝗵𝗮 𝘁𝗵𝗮?","𝗠𝗼𝗼𝗻𝗵 𝗱𝗶𝗸𝗵𝗮... 𝗯𝗼𝘁 𝗯𝗼𝘁 𝗸𝗮𝗿 𝗿𝗮𝗵𝗮","𝗠𝗮𝗾𝘀𝗮𝗱 𝗵𝗮𝗶 𝗷𝗮𝘄𝗮𝗻 𝗹𝗮𝗴𝗻𝗮, 𝗺𝗶𝘀𝗮𝗮𝗹-𝗲-𝗵𝗼𝗼𝗿 𝗵𝗼 𝗷𝗮𝗻𝗮... 𝗹𝗲𝗸𝗶𝗻 𝗷𝗻𝗮𝗯 𝗸𝗼 𝘀𝗮𝗺𝗮𝗷𝗵 𝗵𝗶 𝗻𝗮𝗵𝗶 𝗮𝗮𝘆𝗮, 𝗺𝘂𝗺𝗸𝗶𝗻 𝗵𝗶 𝗻𝗮𝗵𝗶 𝗸𝗶𝘀𝗵𝗺𝗶𝘀𝗵 𝗸𝗮 𝗽𝗵𝗶𝗿 𝘀𝗲 𝗮𝗻𝗴𝘂𝗿 𝗵𝗼 𝗷𝗮𝗻𝗮 😇😇","𝗜𝘁𝗻𝗮 𝗱𝘂𝗯𝗹𝗮 𝗵𝗼 𝗴𝗮𝘆𝗲 𝗵𝗼 𝘀𝗮𝗻𝗮𝗺 𝗺𝗲𝗿𝗶 𝗷𝘂𝗱𝗮𝗮𝗶 𝘀𝗲... 𝗸𝗵𝗮𝘁𝗺𝗮𝗹 𝗯𝗵𝗶 𝗮𝗽𝗸𝗼 𝗸𝗵𝗶𝗰𝗵 𝗹𝗲𝘁𝗲 𝗵𝗮𝗶𝗻 𝗰𝗵𝗮𝗿𝗽𝗮𝗶 𝘀𝗲 🫡😶","𝗠𝗲𝗿𝗶 𝗽𝗮𝘁𝗶 𝗯𝗮𝗻𝗼𝗴𝗲 𝗯𝗮𝗯𝘂 𝗯𝗼𝗵𝗼𝘁 𝗽𝘆𝗮𝗮𝗿 𝗸𝗮𝗿𝘂𝗻𝗴𝗶 😘😘","𝗦𝘂𝗻𝗼 𝗲𝗸 𝗯𝗮𝗮𝘁 𝗸𝗲𝗵𝗻𝗶 𝗺𝘂𝗷𝗵𝗲 𝗮𝗽𝗸𝗲 𝗴𝗮𝗹𝗽𝗲 𝗲𝗸 𝗰𝗵𝗮𝘁𝗮 𝗺𝗮𝗿𝗻𝗶 𝗵𝗮𝗶 😍😍","𝗮𝗶𝘀𝗲 𝗽𝘆𝗮𝗮𝗿 𝗸𝗮𝗿𝘂𝗻𝗴𝗶  , 𝗸𝗮𝗵𝗼 𝘁𝗼 𝗸𝗵𝗮𝗱𝗮 𝗸𝗮𝗿𝗱𝘂..... 𝗿𝗼𝗺 𝗿𝗼𝗺 𝗮𝗽𝗸𝗲 😘❤️","𝗺𝗮𝗶 𝘁𝗼 𝗸𝗲𝗵 𝗿𝗵𝗶 𝘁𝗵𝗶 𝗸𝗮𝗿𝗹𝗼 𝗺𝘂𝗷𝗵𝘀𝗲 𝘀𝗵𝗮𝗱𝗶 𝗱𝗲 𝗴𝘆𝗶 𝗻 𝗱𝗵𝗼𝗸𝗵𝗮 🤕💔" ,];
  var rand = tl[Math.floor(Math.random() * tl.length)]

    if ((event.body.toLowerCase() == "MISS YOU") || (event.body.toLowerCase() == "miss you")) {
     return api.sendMessage("< Miss You Too na 🥹🤖👅/👅-✘  🎀 🍒:))", threadID);
   };

    if ((event.body.toLowerCase() == "😘") || (event.body.toLowerCase() == "😽")) {
     return api.sendMessage("Ummmmmmmmaaaa Baby 😘😘😘😘", threadID);
   };
   
    if ((event.body.toLowerCase() == "help") || (event.body.toLowerCase() == "help")) {
     return api.sendMessage("type /help", threadID);
   };
  
   if ((event.body.toLowerCase() == "sim") || (event.body.toLowerCase() == "simsimi")) {
     return api.sendMessage("simsimi 𝗖𝗼𝗺𝗺𝗲𝗻𝗱 𝗮𝗱𝗱 𝗻𝗮𝗵𝗶 𝗵𝗮𝗶 𝘁𝘆𝗽𝗲 𝗸𝗮𝗿𝗼 baby", threadID);
   };
  
   if ((event.body.toLowerCase() == "Hello") || (event.body.toLowerCase() == "Hii") ||(event.body.toLowerCase() == "...") || (event.body.toLowerCase() == "...")) {
     return api.sendMessage("𝗬𝗲𝘀 𝗯𝗮𝗯𝘆 𝗶'𝗺 𝘆𝗼𝘂𝗿𝘀 𝗽𝗹𝗲𝗮𝘀𝗲 𝗰𝗮𝗹𝗹 𝗺𝗲 ,, 𝗯𝗮𝗯𝘆 𝗯𝗼𝘁  🥺❤️❤️⛏️🐸🤣", threadID);
   };

   if ((event.body.toLowerCase() == "bc") || (event.body.toLowerCase() == "mc")) {
     return api.sendMessage("SAME TO YOU😊 ", threadID);
   };

   if ((event.body.toLowerCase() == "🫦") || (event.body.toLowerCase() == "💋")) {
     return api.sendMessage(" 𝘂𝗺𝗺𝗺𝗺𝗮𝗮𝗮𝗮𝗮 💋💋 ,, 𝘁𝘂𝗺𝗵𝗲 𝗺𝗲𝗿𝗶 𝘁𝗮𝗹𝗮𝗽 𝗹𝗮𝗴𝘁𝗶 𝗵𝗮𝗶 𝗻 𝗯𝗰𝗵𝗵𝗮🥺❤️❤️❤️ ।", threadID);
   };

   if ((event.body.toLowerCase() == "morning") || (event.body.toLowerCase() == "good morning")) {
     return api.sendMessage("GOOD MORNING ,, 𝗸𝘆𝗮  𝗮𝗽𝗸𝗲 𝘁𝗼𝗼𝘁𝗵𝗽𝗮𝘀𝘁 𝗺𝗲𝗶 𝗻𝗮𝗺𝗮𝗸 𝗵𝗮𝗶 ... 🤨🗡️😚", threadID);
   };

   if ((event.body.toLowerCase() == "Bc") || (event.body.toLowerCase() == "Mc")) {
     return api.sendMessage("~ 𝗬𝗲 𝗸𝘆𝗮 𝗵𝗼𝘁𝗮 𝗵𝗮𝗶 🤨🤨 ?? 🤖", threadID);
   };

   if ((event.body.toLowerCase() == "owner") || (event.body.toLowerCase() == "ceo")) {
     return api.sendMessage("‎[𝐎𝐖𝐍𝐄𝐑: 𝗙𝗲𝗲𝗹𝗶𝗶𝗻𝗴𝗹𝗲𝘀𝘀 ッ ☜\𝚈𝚘𝚞 𝙲𝚊𝚗 𝙲𝚊𝚕𝚕 𝙷𝚒𝚖 𝗦𝗼𝗻𝘂.\ 𝐇𝐢𝐬 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐢𝐝 :- https://www.facebook.com/sonu.rajput.only.one.peace   \", threadID);
   };

   if ((event.body.toLowerCase() == "chup") || (event.body.toLowerCase() == "chup hojao") || (event.body.toLowerCase() == "chup kar") || (event.body.toLowerCase() == "chup hoja")) {
     return api.sendMessage("𝗧𝘂𝗺 𝗸𝗵𝘂𝗱 𝗵𝗶 ,  𝗰𝗵𝘂𝗽 𝗵𝗼𝗷𝗮𝗼 😎🤫🤫🤫", threadID);
   };

  if ((event.body.toLowerCase() == "Ram ram") || (event.body.toLowerCase() == "Jay shree ram") || (event.body.toLowerCase() == "Jay shree Krishna") || (event.body.toLowerCase() == "Radhe radhe")) {
     return api.sendMessage("️- Hari krishn , Hari krishn ❤️❤️❤️", threadID);
   };

   

   if ((event.body.toLowerCase() == "Chumma") || (event.body.toLowerCase() == "Chummi")) {
     return api.sendMessage("️Ummmmmmaaaaaaa 💋💋", threadID);
   };

   if ((event.body.toLowerCase() == "thnx") || (event.body.toLowerCase() == "thnxx") || (event.body.toLowerCase() == "thank you") || (event.body.toLowerCase() == "thanks")) {
     return api.sendMessage("️Bass bass ab thnxx mat bolo mujhe bf dilao khush ho jaungi..!🌚⛏️🌶️", threadID);
   };

   if ((event.body.toLowerCase() == "....") || (event.body.toLowerCase() == "...") || (event.body.toLowerCase() == "😠") || (event.body.toLowerCase() == "🤬") || (event.body.toLowerCase() == "😾")) {
     return api.sendMessage("️𝗢𝗹𝗲 𝗺𝗲𝗹𝗮 𝗯𝗮𝘅𝗰𝗵𝗮 𝗶𝘁𝗻𝗮 𝗴𝘂𝘀𝘀𝗮 𝗻𝗵𝗶 𝗸𝗮𝗿𝘁𝗲 𝘀𝗲𝗵𝗮𝘁 𝗸𝗲 𝗹𝗶𝘆𝗲 𝗮𝗰𝗵𝗶 𝗯𝗮𝗮𝘁 𝗻𝗵𝗶 𝗵𝗮𝗶 💋🥰🥰", threadID);
   };

   if ((event.body.toLowerCase() == "Miss you") || (event.body.toLowerCase() == "Love you") || (event.body.toLowerCase() == "I Love You") || (event.body.toLowerCase() == "ভালোবাসি") || (event.body.toLowerCase() == "i love you")) {
     return api.sendMessage("𝗣𝘆𝗮𝗮𝗿 𝗯𝗼𝗹𝗸𝗲 𝗸𝘂𝗰𝗵 𝗻𝗵𝗶 𝗵𝗮𝗶 𝗱𝘂𝗻𝗶𝘆𝗮 𝗺𝗲 𝗼𝗿 𝗻𝗮𝘁𝗮𝗸 𝗺𝗮𝘁 𝗸𝗿𝗼 😪🥱", threadID);
   };

     if ((event.body.toLowerCase() == "by") || (event.body.toLowerCase() == "Bye") || (event.body.toLowerCase() == "jaiga") || (event.body.toLowerCase() == "বাই") || (event.body.toLowerCase() == "pore kotha hbe") || (event.body.toLowerCase() == "যাই গা")) {
     return api.sendMessage("𝗸𝗮𝗵𝗮 𝗷𝗮𝗿𝗵𝗲 𝗵𝗼 𝗺𝘂𝗷𝗵𝗲 𝘀𝗮𝘁𝗵 𝗹𝗲𝗸𝗲 𝗻𝗵𝗶 𝗷𝗮𝗼𝗴𝗲.!🌚🌶️🍆⛏️", threadID);
   };

   if ((event.body.toLowerCase() == "Dinner") || (event.body.toLowerCase() == "khaya")) {
     return api.sendMessage("Khana banrah hai yh  𝗕𝗮𝗻𝗰𝗵𝘂𝗸𝗮 𝗵𝗮𝗶 𝘆𝗵  fir tumhe bnani nhi ati 😪😪😪<😘", threadID);
   };

   if ((event.body.toLowerCase() == "Bot") || (event.body.toLowerCase() == "bot")) {
     return api.sendMessage("𝗞𝘆𝗮 𝗵𝘂𝗮 𝗯𝗼𝗹𝗼 𝗺𝘂𝗷𝗵𝗲 𝘆𝗮𝗮𝗱 𝗸𝗶𝘆𝗲 🤨❤️☺️", threadID);
   };
  mess = "{name}"
  
  if (event.body.indexOf("/Bot") == 0 || (event.body.indexOf("/bot") == 0)) {
    var msg = {
      body: `${name}, ${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
